programming/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Programming - labs127.io and me</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Programming - labs127.io and me"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015-10-01"/>
<meta name="author" content="Kholid Fuadi"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../stylesheet.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Programming - labs127.io and me</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 intro.labs127.io</a>
<ul>
<li><a href="#sec-1-1">1.1 Disclaimer</a></li>
<li><a href="#sec-1-2">1.2 Question</a></li>
</ul>
</li>
<li><a href="#sec-2">2 server.labs127.io</a>
<ul>
<li><a href="#sec-2-1">2.1 Mencegah SSH Timeout</a></li>
<li><a href="#sec-2-2">2.2 Membuat / Menambah swap di Ubuntu</a></li>
<li><a href="#sec-2-3">2.3 Set Locale di Ubuntu Server</a></li>
</ul>
</li>
<li><a href="#sec-3">3 python.labs127.io</a>
<ul>
<li><a href="#sec-3-1">3.1 Deploy Flask + Nginx + Supervisor di Ubuntu</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1 Add user di Ubuntu</a></li>
<li><a href="#sec-3-1-2">3.1.2 Install needed package</a></li>
<li><a href="#sec-3-1-3">3.1.3 Install virtualenv &amp; supervisor</a></li>
<li><a href="#sec-3-1-4">3.1.4 git clone</a></li>
<li><a href="#sec-3-1-5">3.1.5 Setting virtualenv</a></li>
<li><a href="#sec-3-1-6">3.1.6 Setting supervisor</a></li>
<li><a href="#sec-3-1-7">3.1.7 Sunting berkas run.py</a></li>
<li><a href="#sec-3-1-8">3.1.8 Setting nginx</a></li>
<li><a href="#sec-3-1-9">3.1.9 Jalankan supervisor</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2 Install library lxml di dalam virtualenv</a></li>
<li><a href="#sec-3-3">3.3 Catch search engine terms with python, flask and mongo</a></li>
<li><a href="#sec-3-4">3.4 Mencegah Cascade di django models</a></li>
<li><a href="#sec-3-5">3.5 CSS, JS dan IMG tidak mau load di django-admin</a></li>
<li><a href="#sec-3-6">3.6 Setting gunicorn + django + nginx</a></li>
</ul>
</li>
<li><a href="#sec-4">4 emacs.labs127.io</a></li>
<li><a href="#sec-5">5 js.labs127.io</a></li>
<li><a href="#sec-6">6 reading.labs127.io</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> intro.labs127.io</h2>
<div class="outline-text-2" id="text-1">

<p>Akhirnya menemukan <i>platform</i> yang nyaman buat menampung momen2
<i>gotchas</i> yang penulis alami selama terjun di dunia
per-coding-an. Tidak ada yang spesial, hanya berkas <code>.html</code> biasa, dengan
sedikit bumbu stylesheet yang juga didapat dari browsing di internet.
</p>
<p>
Menggunakan <code>emacs</code> <code>org-mode</code>, penulis dapat dengan nyaman membuat
tulisan menggunakan <code>.org</code>, kemudian meng-export berkas tersebut ke html
dengan semudah menekan <code>C c e h</code>, dan berkas org berubah menjadi html
dalam sekejap.
</p>
<p>
Selanjutnya tinggal seremonial git, dan artikel sudah live!
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Disclaimer</h3>
<div class="outline-text-3" id="text-1-1">

<p>Penulis tidak bertanggungjawab jika ternyata sebagian atau seluruh
bagian dari artikel ini tidak works lagi, mungkin karena versi yang
berbeda atau karena perbedaan environment.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Question</h3>
<div class="outline-text-3" id="text-1-2">

<p>Jika ada pertanyaan, silakan mention saya di twitter: @sopier. Tidak
ada jaminan bisa memberikan solusi pasti, sekedar diusahakan sesuai
kemampuan.
</p></div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> server.labs127.io</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Mencegah SSH Timeout</h3>
<div class="outline-text-3" id="text-2-1">

<p>  Bagi Anda yang sering melakukan koneksi SSH ke server, tentu sangat
  mengganggu bukan? Solusinya mudah, tambahkan atau buat konfigurasi baru
  di berkas <code>~/.ssh/config</code>:
</p>



<pre class="example">Host *
  ServerAliveInterval 10
</pre>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Membuat / Menambah swap di Ubuntu</h3>
<div class="outline-text-3" id="text-2-2">

<p>  Terkadang karena keterbatasan <i>memory</i>, kita tidak dapat melakukan
  instalasi paket atau <i>library</i> tertentu di server. Hal ini pernah penulis
  alami ketika akan memasang <i>library</i> <code>pandas</code>. Daripada harus upgrade 
  droplet, saya coba membuat swap di server tersebut, dan setelah membuat
  swap sebesar 1GB, library tersebut berhasil terpasang dengan sukses.
</p>
<p>
  Berikut ini langkah-langkahnya:
</p>


<pre class="example"># create new partition 1M * 1024 = 1GB
dd if=/dev/zero of=/swapfile bs=1M count=1024
# set as swap
mkswap /swapfile
# activate the swap once
swapon /swapfile
# add to /etc/fstab to auto load when reboot [optional]
/swapfile swap swap defaults 0 0
</pre>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Set Locale di Ubuntu Server</h3>
<div class="outline-text-3" id="text-2-3">

<p>Ini hal wajib yang perlu dilakukan ketika setup server, karena jika
belum diset, biasanya ada beberapa masalah yang muncul, misal tidak
mau login ke mongo console atau psql (postgresql).
</p>
<p>
Cara untuk setting locale (ubuntu) adalah dengan menyunting berkas 
<code>/etc/default/locale</code> dan isikan baris config berikut:
</p>



<pre class="example">LC_ALL="en_US.UTF-8"
LANG="en_US.UTF-8"
LANGUAGE="en_US.UTF-8"
</pre>


<p>
Selanjutnya silakan re-login atau reboot, agar setting berlaku.
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> python.labs127.io</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Deploy Flask + Nginx + Supervisor di Ubuntu</h3>
<div class="outline-text-3" id="text-3-1">


</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Add user di Ubuntu</h4>
<div class="outline-text-4" id="text-3-1-1">




<pre class="example">adduser sopier
adduser sopier sudo
</pre>

</div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Install needed package</h4>
<div class="outline-text-4" id="text-3-1-2">




<pre class="example">sudo apt-get install build-essential python-dev python-pip nginx
emacs24-nox git
</pre>

</div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Install virtualenv &amp; supervisor</h4>
<div class="outline-text-4" id="text-3-1-3">




<pre class="example">sudo pip install virtualenv supervisor
</pre>

</div>

</div>

<div id="outline-container-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> git clone</h4>
<div class="outline-text-4" id="text-3-1-4">




<pre class="example">git clone https://github.com/sopier/example.com
</pre>

</div>

</div>

<div id="outline-container-3-1-5" class="outline-4">
<h4 id="sec-3-1-5"><span class="section-number-4">3.1.5</span> Setting virtualenv</h4>
<div class="outline-text-4" id="text-3-1-5">




<pre class="example">cd example.com
virtualenv .
. bin/activate
pip install -r requirements.txt
pip install uwsgi
</pre>

</div>

</div>

<div id="outline-container-3-1-6" class="outline-4">
<h4 id="sec-3-1-6"><span class="section-number-4">3.1.6</span> Setting supervisor</h4>
<div class="outline-text-4" id="text-3-1-6">

<p>Buat berkas baru, misal di <code>~/supervisord.conf</code>, dan isikan baris
konfigurasi berikut:
</p>


<pre class="example">[unix_http_server]
file=/tmp/uwsgi.sock   ; (the path to the socket file)

[supervisord]
logfile=/tmp/supervisord.log ; (main log file;default $CWD/supervisord.log)
logfile_maxbytes=50MB       ; (max main logfile bytes b4 rotation;default 50MB)
logfile_backups=10          ; (num of main logfile rotation backups;default 10)
loglevel=info               ; (log level;default info; others: debug,warn,trace)
pidfile=/tmp/supervisord.pid ; (supervisord pidfile;default supervisord.pid)
nodaemon=false              ; (start in foreground if true;default false)
minfds=1024                 ; (min. avail startup file descriptors;default 1024)
minprocs=200

[rpcinterface:supervisor]
supervisor.rpcinterface_factory = supervisor.rpcinterface:make_main_rpcinterface

[supervisorctl]
logfile=/tmp/supervisord.log ; (main log file;default $CWD/supervisord.log)
serverurl=unix:///tmp/uwsgi.sock ; use a unix:// URL

[program:example.com]
command=/home/sopier/example.com/bin/uwsgi --socket /tmp/uwsgi.sock --module run --callable app -H /home/sopier/example.com/ --chdir /home/sopier/example.com/ --chmod-socket=666 --processes=5
directory=/home/sopier/example.com/
autostart=true
autorestart=true
stdout_logfile=/tmp/example.log
redirect_stderr=true
stopsignal=QUIT
</pre>

</div>

</div>

<div id="outline-container-3-1-7" class="outline-4">
<h4 id="sec-3-1-7"><span class="section-number-4">3.1.7</span> Sunting berkas run.py</h4>
<div class="outline-text-4" id="text-3-1-7">

<p>Berikut ini setting untuk run.py (sesuaikan seperlunya):
</p>


<pre class="example">#!/usr/bin/env python
from app import app

if __name__ == "__main__":
    app.run(debug=False)
</pre>

</div>

</div>

<div id="outline-container-3-1-8" class="outline-4">
<h4 id="sec-3-1-8"><span class="section-number-4">3.1.8</span> Setting nginx</h4>
<div class="outline-text-4" id="text-3-1-8">

<p>Berikut ini adalah konfigurasi nginx sederhana tapi works:
</p>


<pre class="example">server {
    listen        80;
    server_name   www.example.com;
    location / { try_files $uri @app; }
    location @app {
        include uwsgi_params;
        uwsgi_pass unix:/tmp/uwsgi.sock;
    }
}
</pre>

<p>
Atau jika Anda ingin multiple site, berikut ini contoh konfigurasinya:
</p>


<pre class="example">server {
    listen        80;
    server_name   www.example1.com;
    location / { try_files $uri @app; }
    location @app {
        include uwsgi_params;
        uwsgi_pass unix:/tmp/uwsgi1.sock;
    }
}
server {
    listen        80;
    server_name   www.example2.com;
    location / { try_files $uri @app; }
    location @app {
        include uwsgi_params;
        uwsgi_pass unix:/tmp/uwsgi2.sock;
    }
}
</pre>

</div>

</div>

<div id="outline-container-3-1-9" class="outline-4">
<h4 id="sec-3-1-9"><span class="section-number-4">3.1.9</span> Jalankan supervisor</h4>
<div class="outline-text-4" id="text-3-1-9">

<p>Terakhir, jalankan <code>supervisor</code> dengan menjalankan perintah berikut:
</p>


<pre class="example">sudo supervisord -c ~/supervisord.conf
</pre>

</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Install library lxml di dalam virtualenv</h3>
<div class="outline-text-3" id="text-3-2">




<pre class="example">sudo apt-get install libxml2-dev libxslt-dev
</pre>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Catch search engine terms with python, flask and mongo</h3>
<div class="outline-text-3" id="text-3-3">




<pre class="example"># pip install referer_parser
from referer_parser import Referer
# dbase
import pymongo

c = pymongo.Connection()
refdb = c['referer']

# ganti "-" =&gt; " " pada q                                                     
t = q.replace("-", " ")

# referer tracker                                                             
try:
    head = request.headers
    url = head['Referer']
    refobj = Referer(url)
    # setem ini sudah bersih!
    setem = refobj.search_term

    # jika ada setem, input into db                                                   
    if setem:
        # jika lom ada setem, insert!                                               
        if refdb.term.find_one({"q": t}) is None:
            refdb.term.insert({"q": t, "refer": {setem: 1}})
        # jika sudah ada, pilihannya ada 2, set atau increment!
        else:
            # jika sudah ada setem, increment!                                      
            if setem in refdb.term.find_one({"q": t})['refer']:
                refdb.term.update({"q": t}, {"$inc": {"refer." + str(setem): 1}}, upsert=True)
            # jika lom ada setem, set setem: 1!                                     
            elif setem not in refdb.term.find_one({"q": t})['refer']:
                refdb.term.update({"q": t}, {"$set": {"refer." + str(setem): 1}}, upsert=True)
except:
    pass

# sorting term
sorted(db.term.find_one({"q": t})['refer'].items(), key=lambda x: x[1], reverse=True)
</pre>

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Mencegah Cascade di django models</h3>
<div class="outline-text-3" id="text-3-4">

<p>django, by default menggunakan cascade untuk model ForeignKey, ini artinya
jika data child dihapus maka data parent juga ikut terhapus. Untuk mencegah
hal ini, kita dapat menambahkan argument berikut:
</p>



<pre class="example">nama = models.ForeignKey(Guru, on_delete=models.SET_NULL)
</pre>


<p>
Jika setting sudah benar, tandanya ada tanda silang di sebelah field
ForeignKey.
</p></div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> CSS, JS dan IMG tidak mau load di django-admin</h3>
<div class="outline-text-3" id="text-3-5">

<p>Jika hal ini terjadi, berarti setting nginx Anda perlu dibenahi, yakni
dengan menambahkan location <i>static</i> di konfig nginx Anda, misal
sebagai berikut:
</p>



<pre class="example">server {
    ...

    location /static/ {
        alias /home/sopier/mslib/mslib/static/;
    }

    ...
}
</pre>

</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Setting gunicorn + django + nginx</h3>
<div class="outline-text-3" id="text-3-6">

<p>Dengan asumsi struktur direktori sebagai berikut:
</p>



<pre class="example">mslib/
├── app
│   ├── admin.py
│   ├── __init__.py
│   ├── migrations
│   ├── models.py
│   ├── tests.py
│   ├── urls.py
│   ├── views.py
├── manage.py
├── mslib
│   ├── __init__.py
│   ├── settings.py
│   ├── urls.py
│   ├── wsgi.py
├── static
│   ├── admin
│   ├── app
│   └── js
└── templates
    ├── 404.html
    ├── admin
    └── app
</pre>


<p>
Dan berikut ini setting untuk nginx:
</p>



<pre class="example">upstream app_server {
   server 127.0.0.1:8000 fail_timeout=0;
}

server {
   listen 80;
   server_name 159.xxx.xxx.xxx;
   client_max_body_size 4G;
   proxy_read_timeout 1200;

   location / {
       proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
       proxy_set_header Host $http_host;
       proxy_redirect off;
       proxy_pass http://app_server;
       if (!-f $request_filename) {
           proxy_pass http://app_server;
           break;
       }
   }

   location /static/ {
       alias /home/sopier/mslib/mslib/static/;
   }

   location /media/ {
       alias /home/sopier/mslib/mslib/collections/;
   }
}
</pre>


<p>
Maka untuk menjalankan gunicorn:
</p>



<pre class="example">gunicorn --env DJANGO_SETTINGS_MODULE=mslib.settings mslib.wsgi --bind 127.0.0.1:8000
</pre>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> emacs.labs127.io</h2>
<div class="outline-text-2" id="text-4">

<p>**COMING SOON
</p></div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> js.labs127.io</h2>
<div class="outline-text-2" id="text-5">

<p>**COMING SOON
</p></div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> reading.labs127.io</h2>
<div class="outline-text-2" id="text-6">

<p>**COMING SOON
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2015-10-01</p>
<p class="author">Author: Kholid Fuadi</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
